{
  "user_skill_level": "Beginner",
  "general_summary": "Great effort in this session! You demonstrated excellent form in your first repetition, showing your potential. We'll focus on improving head position during the movement, achieving full range of motion, and controlling your tempo to make every rep even more effective and safer.",
  "gamification": {
    "form_score": 58,
    "xp_earned": 250,
    "current_level_title": "Form Explorer",
    "streak_bonus": false
  },
  "strengths": [
    "Consistent neutral spine alignment in controlled repetitions."
  ],
  "weaknesses": [
    "Maintaining neutral cervical spine position throughout the movement.",
    "Achieving full lockout/extension at the top of the movement.",
    "Controlling eccentric (descent) tempo."
  ],
  "remedial_plan": [
    {
      "name": "Chin Tucks / Neck Retractions",
      "target_fault": "Cervical spine flexion (head dropping forward)",
      "prescription": "3 sets of 10-15 slow, controlled repetitions, holding for 2 seconds.",
      "adaptive_reasoning": "This exercise directly strengthens the deep neck flexors and improves your awareness of a neutral head position, which is crucial for preventing your head from dropping forward during movements and reducing neck strain."
    },
    {
      "name": "Push-up Plus",
      "target_fault": "Incomplete lockout / soft elbows",
      "prescription": "3 sets of 8-12 repetitions, focusing on maximal protraction at the top.",
      "adaptive_reasoning": "To encourage full extension and stability at the top of your movements, the Push-up Plus builds strength and control around your shoulder blades, supporting a complete and stable lockout without hyperextension."
    },
    {
      "name": "Tempo Push-ups (3-0-1-0)",
      "target_fault": "Rapid eccentric (descent) tempo",
      "prescription": "3 sets of 6-8 repetitions, focusing on a 3-second lowering phase.",
      "adaptive_reasoning": "To address the rapid descent and loss of control, practicing push-ups with a controlled 3-second eccentric phase will build crucial muscle control, stability, and strength, ensuring better form and preventing injury throughout the entire movement."
    }
  ],
  "timeline_events": [
    {
      "start_time": 1.5,
      "end_time": 3.0,
      "overlay_text": "Great form!",
      "detailed_explanation": "Excellent work maintaining a neutral spine and full range of motion throughout this repetition. This is a strong example of proper form and a great starting point for your training!",
      "correction_cue": "strength",
      "status_color": "green"
    },
    {
      "start_time": 4.5,
      "end_time": 6.0,
      "overlay_text": "Keep head neutral!",
      "detailed_explanation": "During this rep, your head dropped significantly, causing excessive cervical spine flexion. This can put unnecessary strain on your neck. Focus on keeping your gaze slightly forward and your head aligned with your spine to protect your neck.",
      "correction_cue": "weakness",
      "status_color": "red"
    },
    {
      "start_time": 7.5,
      "end_time": 9.0,
      "overlay_text": "Lockout elbows!",
      "detailed_explanation": "You showed an incomplete lockout at the top of this repetition, keeping your elbows slightly bent. Aim to achieve full extension at the top of the movement to maximize muscle engagement and complete the full range of motion effectively.",
      "correction_cue": "weakness",
      "status_color": "yellow"
    },
    {
      "start_time": 10.5,
      "end_time": 12.0,
      "overlay_text": "Control your descent!",
      "detailed_explanation": "Your descent was too rapid in this rep, leading to a loss of control at the bottom. Focus on a controlled, slower eccentric phase (the lowering portion) to build strength, maintain stability, and improve overall muscle activation throughout the movement.",
      "correction_cue": "weakness",
      "status_color": "yellow"
    }
  ]
}